class Solution {
    boolean solution(String s) {
        int count = 0;
        s = s.toLowerCase();
        
        for (int i = 0; i < s.length(); i++) {
            if (s.charAt(i) == 'p') count++;
            else if (s.charAt(i) == 'y') count--;
        }

        return count == 0;
    }
}


정확성  테스트
테스트 1 〉	통과 (0.04ms, 68.2MB)
테스트 2 〉	통과 (0.04ms, 71.2MB)
테스트 3 〉	통과 (0.03ms, 73MB)
테스트 4 〉	통과 (0.03ms, 79.8MB)
테스트 5 〉	통과 (0.04ms, 77.9MB)
테스트 6 〉	통과 (0.03ms, 77.9MB)
테스트 7 〉	통과 (0.03ms, 73.1MB)
테스트 8 〉	통과 (0.03ms, 74MB)
테스트 9 〉	통과 (0.04ms, 77.7MB)
테스트 10 〉	통과 (0.02ms, 72.9MB)
테스트 11 〉	통과 (0.03ms, 72.7MB)
테스트 12 〉	통과 (0.02ms, 72.7MB)
테스트 13 〉	통과 (0.05ms, 71.6MB)
테스트 14 〉	통과 (0.05ms, 66.9MB)
테스트 15 〉	통과 (0.03ms, 73.4MB)
테스트 16 〉	통과 (0.03ms, 73.9MB)
테스트 17 〉	통과 (0.03ms, 73.9MB)
테스트 18 〉	통과 (0.03ms, 75MB)
테스트 19 〉	통과 (0.03ms, 76MB)
테스트 20 〉	통과 (0.03ms, 76.2MB)
테스트 21 〉	통과 (0.03ms, 78.7MB)
테스트 22 〉	통과 (0.03ms, 74.2MB)
테스트 23 〉	통과 (0.03ms, 77MB)
테스트 24 〉	통과 (0.03ms, 77.4MB)
테스트 25 〉	통과 (0.04ms, 78.2MB)
테스트 26 〉	통과 (0.04ms, 73.1MB)
테스트 27 〉	통과 (0.04ms, 75.3MB)
테스트 28 〉	통과 (0.03ms, 71.7MB)
테스트 29 〉	통과 (0.04ms, 65.8MB)
테스트 30 〉	통과 (0.03ms, 74.1MB)
